---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementGeometryCalculator.#ctor(Autodesk.Revit.DB.Document)
source: html/f68e2c88-362d-fe99-a005-bce286762fe8.htm
---
# Autodesk.Revit.DB.SpatialElementGeometryCalculator.#ctor Method

Constructs a new calculator with default options for the geometry of spatial elements.

## Syntax (C#)
```csharp
public SpatialElementGeometryCalculator(
	Document aDoc
)
```

## Parameters
- **aDoc** (`Autodesk.Revit.DB.Document`) - The document that contains the spatial elements.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null